import { useSelector } from "react-redux";
import DiscountCarousel from "../../components/CarouselSlider/DiscountCarousel";
import { RootState } from "../../store";
import ErrorPage from "../../components/common/ErrorPage/ErrorPage";
import { useLocation } from "react-router-dom";

const MainPage = () => {
  const cityName = useSelector((state: RootState) => state.city.cityName);
  const citySlug = useSelector((state: RootState) => state.city.citySlug);

  const location = useLocation();

  const isPathValid =
    location.pathname === `/${citySlug}` || location.pathname === "/";

  return isPathValid ? (
    <>
      <div className={cityName === "Київ" ? "" : "mb-52"}>
        <DiscountCarousel />
      </div>
      {cityName == "Київ" && (
        <section className="seo-block">
          <p>
            Замовити їжу в Києві досить поширена і вже звична послуга, яку
            здійснюють багато ресторанів або служби доставки. Адже головне для
            сучасної людини – не витратити забагато часу на придбання продуктів
            для їх подальшого приготування, а надати перевагу витратам
            дорогоцінного часу на щось більш цікаве, ніж дещо обтяжливе
            господарювання на кухні. Тому швидка доставка їжі – дійсно правильне
            рішення для тих, хто любить смачненьке, проте не готовий ставати до
            довгих кухонних справ.
          </p>
          <p>
            <br />
          </p>
          <p>
            Доставка їжі додому – зручний і комфортний спосіб організації
            легкого перекусу або ситного обіду, смачного сніданку або
            романтичної вечері. В Україні, окрім традиційних національних страв,
            дуже популярне італійське та японське меню:
          </p>
          <p>
            <br />
          </p>
          <ul className="ml-4 list-disc">
            <li>
              Ви можете замовити італійську їжу в Києві та отримати справжню
              піцу, пасту та інші знакові страви, які притаманні сонячній
              Італії.
            </li>
            <li>
              Якщо ж душа потребує східної екзотики, то тоді найкраще рішення –
              скуштувати сет з ролами та суши, які є справжньою кулінарною
              візитівкою Японії. В наші часи замовити японську їжу в Києві - це
              дуже просто та швидко.
            </li>
          </ul>
          <p>
            <br />
          </p>
          <p>
            Зручна і комфортна послуга «Швидка доставка їжі від MAFIA» – чудове
            рішення для сучасних, мобільних людей, які цінують свій час, а також
            поважають оригінальну і смачну їжу. Ви без особливих зусиль зможете
            замовити їжу в Києві в будь-якому ресторані мережі MAFIA, і це буде
            завжди ваш найсмачніший та дійсно поживний сніданок, бізнес-ланч,
            обід чи вечеря. Неважливо, світло чи темно на дворі, якщо вам дуже
            закортіло скуштувати піцу або суші, MAFIA з радістю стане для вас
            особистим поваром та нагодує вас швидко та смачно.
          </p>
          <p>
            <br />
          </p>
          <p>
            У нашому меню ви можете знайти різноманітні, яскраві і улюблені
            багатьма страви японської або італійської кухні: суші, роли, піцу,
            пасту, лазанью і багато іншого.
          </p>
          <p>
            <br />
          </p>
          <p>
            Замовити японську їжу в Києві від MAFIA прикрасить, як звичайний
            буденний день, так і чудовий святковий вечір. Адже ми доставляємо не
            просто їжу, ми доставляємо емоції!
          </p>
          <p>
            <br />
          </p>
          <p>
            У нашому меню ви можете знайти різноманітні, яскраві і улюблені
            багатьма страви японської або італійської кухні: суші, роли, піцу,
            пасту, лазанью і багато іншого.
          </p>
          <p>
            <br />
          </p>
          <p>
            Залиште довгі години готування на кухні! Насолоджуйтесь життям! А
            MAFIA подбає, щоб це було зроблено зі смаком!
          </p>
        </section>
      )}
    </>
  ) : (
    <ErrorPage />
  );
};

export default MainPage;
